//클래스
//- 객체를 만드는 틀 , 객체를 만들기위한 설계도
//- 클래스를 만들때는 class 클래스명{  } 으로 만들 수 있습니다.
//
//객체  (객체란 속성(상태)과 기능(동작)을 가진 덩어리)
//- 객체는 속성과 기능의 집합이며, 속성과 기능을 객체의 멤버라고 한다.
//- 속성(Property) : 멤버변수(member variable), 특성(attribute), 필드(field), 상태(state)
//- 기능(function) : 메서드(method), 행위(behavior), 함수(function)
//
//인스턴스 (생성된 객체, 어떤 클래스에 속하는 각각의 객체)
//- 객체를 생성하여 JVM(자바 가상 머신)이 관리하는 메모리에 적재된 것을 의미
//- 어떤 클래스로부터 만들어진 객체를 그 클래스의 인스턴스라고 합니다.
//- 클래스로부터 객체를 만드는 과정을 인스턴스화 라고 한다.
//- 특징 : 클래스가 가지고 있는 메소드(method)를 모두 상속 받는다. 
//
//객체와 인스턴스
//- 객체는 인스턴스를 포함하는 일반적인 의미
//- 인스턴스화 : 클래스로부터 인스턴스를 생성하는 것
//- 클래스 -> 인스턴스화 -> 인스턴스(객체)